[
  {
    "title": "Red Tape Casual Sneaker Shoes for Men | Stylish and Comfortable",
    "category": "Shoes & Handbags",
    "details": [
      "MATERIAL: Upper - PU | Outsole - TPR (Thermoplastic Rubber)",
      "FEATURES: Closure - Lace-Up | TOE SHAPE- Round Toe",
      "Benefits: Experience ultimate comfort through the TPU + TPR Sole of these shoes. Enjoy dynamic feet and arch support, coupled with slip-resistant features that effectively eliminate the possibility of accidental falls.",
      "These shoes offer continuous comfort throughout the day, ensuring your feet stay relaxed, all while maintaining a casually stylish appearance.",
      "Lifestyle: Sneaker Shoes",
      "Care Instruction : Wipe with a clean, dry cloth to remove the dust."
    ],
    "image": "https://m.media-amazon.com/images/I/41o75CZtK-L._SY395_SX395_.jpg",
    "price": {
      "payable": "1119",
      "savings": "80"
    }
  },
  {
    "title": "Bacca Bucci Ranger Dunks Low Top Classic Sneakers for Men | Casual Shoes for Men with Memory Cushion Footbed",
    "category": "Shoes & Handbags",
    "details": [
      "Comfortable Low-Top Flat Sole Men Sneakers:- Made from Durable PU with Mesh and Durable Material, these men's sneakers are soft, comfortable, and breathable, bringing you in comfort all day long, and ideal for daily wear and sports.",
      "Non-slip Flat Sole:- The anti-slip and rubber outsole design provides excellent anti-slip and shock-proof performance, making you more comfortable and stable to wear, without worrying about falling.",
      "Urban Street-Style Design:- These White Sneakers with Screen Print combination, unique laces, Flame vamp, exquisite PU mix, and Accessories, making color contrast for visual impact. Pair with your favorite cloth for a fabulous look, or with your everyday casual for effortlessly chic style.",
      "Daily Life Use:- Unique Fashion design perfect choice to pair with any occasion: casual, walking, Dancing, jogging, indoor, sports, outdoor, travel, exercise, workout, and so on.",
      "Fashion Classic Sneakers:- These sneakers for men are inspired by Customized Artwork, which comes with a stylish appearance and classic style, perfect with sports and casual wear, suitable for daily wear, walking, sports, work, and so on."
    ],
    "image": "https://m.media-amazon.com/images/I/41jeEQC2JgL._SY395_SX395_.jpg",
    "price": {
      "payable": "1589",
      "savings": "47"
    }
  }
]